# 01 - Fusion des données (BAAC 2024)

Ce notebook a pour objectif de charger les données brutes de la sécurité routière française pour l'année 2024. 
Nous allons fusionner les tables principales pour créer un jeu de données consolidé prêt pour l'analyse.

**Données utilisées :**
- `usagers-2024.csv` : Informations sur les personnes impliquées.
- `caract-2024.csv` : Contexte de l'accident (météo, lieu, date).

In [1]:
import pandas as pd

# Chemins relatifs vers tes fichiers
path_usagers = "../data/usagers-2024.csv"
path_carac = "../data/caract-2024.csv"

# Chargement 
usagers = pd.read_csv(path_usagers, sep=";", encoding="UTF-8")
carac = pd.read_csv(path_carac, sep=";", encoding="UTF-8")

print(f"Nombre d'usagers : {usagers.shape[0]}")
print(f"Nombre d'accidents (caractéristiques) : {carac.shape[0]}")

Nombre d'usagers : 125187
Nombre d'accidents (caractéristiques) : 54402

In [2]:
# On fusionne les deux tables sur l'ID de l'accident
df = pd.merge(usagers, carac, on="Num_Acc", how="inner")

df.head()

,Num_Acc,id_usager,id_vehicule,num_veh,place,catu,grav,sexe,an_nais,trajet,...,lum,dep,com,agg,int,atm,col,adr,lat,long
0,202400000001,203 988 581,155 781 758,A01,1,1,3,1,2003.0,2,...,2,70,70285,1,1,5,1,D438,"47,56277000","6,75832000"
1,202400000001,203 988 582,155 781 759,B01,1,1,1,1,1997.0,4,...,2,70,70285,1,1,5,1,D438,"47,56277000","6,75832000"
2,202400000002,203 988 579,155 781 757,A01,10,3,3,2,1927.0,5,...,1,21,21054,2,3,7,6,HOTEL DIEU (RUE DE L'),"47,02109000","4,83755000"
3,202400000002,203 988 580,155 781 757,A01,1,1,1,1,1987.0,4,...,1,21,21054,2,3,7,6,HOTEL DIEU (RUE DE L'),"47,02109000","4,83755000"
4,202400000003,203 988 574,155 781 756,A01,2,2,4,2,2007.0,5,...,2,15,15012,1,1,1,6,Allée des Tilleuls,"44,90238400","2,49641800"